In [1]:
import pandas as pd
df = pd.read_csv("Salaries(1).csv")
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [2]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [9]:
df.head(7) # first 7 row varum

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [7]:
df.tail(7) # last 7 row varum

         rank discipline  phd  service     sex  salary
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [8]:
df.mean()  # all number total panni enthana number irukunu count panni total/number like 145/10

C:\Users\gunak\AppData\Local\Temp\ipykernel_7264\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [9]:
df.axes # ethana row irukku ethana column irukkunu kaatum axis = 0 na row la changes nadakkum axis = 1 na column la changes nadakum

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [10]:
df.ndim

2

In [17]:
df.size

468

In [18]:
df.shape

(78, 6)

In [20]:
df.describe() # count ethana iruku mean ethana irukku std ethana iruku space ethana irukkunu kaatum reportcard mathirivanthudum

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [21]:
type(df["phd"])

pandas.core.series.Series

In [25]:
df.loc[0:10,"phd"]

0     56
1     12
2     23
3     40
4     20
5     20
6     20
7     18
8     29
9     51
10    39
Name: phd, dtype: int64

In [26]:
df.iloc[:,[1,2,3]]

   discipline  phd  service
0           B   56       49
1           A   12        6
2           A   23       20
3           A   40       31
4           B   20       18
..        ...  ...      ...
73          B   18       10
74          B   19        6
75          B   17       17
76          A   28       14
77          A   23       15

[78 rows x 3 columns]

In [4]:
df.iloc[:,[0,3]]

         rank  service
0        Prof       49
1        Prof        6
2        Prof       20
3        Prof       31
4        Prof       18
..        ...      ...
73       Prof       10
74  AssocProf        6
75       Prof       17
76       Prof       14
77       Prof       15

[78 rows x 2 columns]

In [29]:
max(df["phd"])

56

In [31]:
min(df["salary"])

57800

In [32]:
df.max() # total la max value varum

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [33]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [34]:
df.mean()

C:\Users\gunak\AppData\Local\Temp\ipykernel_7264\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [35]:
df.median()

C:\Users\gunak\AppData\Local\Temp\ipykernel_7264\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [36]:
df.std()

C:\Users\gunak\AppData\Local\Temp\ipykernel_7264\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [40]:
df.sample(4) #random ma irukura dataframe varum

        rank discipline  phd  service   sex  salary
9       Prof          A   51       51  Male   57800
12  AsstProf          B    1        0  Male   88000
15      Prof          B   17        3  Male  150480
27      Prof          A   45       43  Male  155865

In [42]:
df["rank"].value_counts() # rank la prof ethana vaati irukunu kaatum prof moththam ethana thadava irukkunu kaatum

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [46]:
df["rank"].nunique() # n koduththa number la varum

3

In [47]:
df["rank"].unique() # name la varum

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [49]:
df["rank"].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

df.describe(include= "all")

In [50]:

df.columns # column name vanthudum

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [51]:
df.dtypes # types varum

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [57]:
df[df["phd"]>50]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
9  Prof          A   51       51  Male   57800

In [64]:
df.loc[(df["phd"]>10) & (df["salary"] == 57800)] #brackit use pannanum ( ) df.iloc number la varum loc name la varum

   rank discipline  phd  service   sex  salary
9  Prof          A   51       51  Male   57800

In [65]:
df.iloc[-1] ,

rank            Prof
discipline         A
phd               23
service           15
sex           Female
salary        109646
Name: 77, dtype: object

In [66]:
df.sort_values(by = "service")

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
..       ...        ...  ...      ...     ...     ...
40      Prof          A   39       36  Female  137000
27      Prof          A   45       43    Male  155865
36      Prof          B   45       45    Male  146856
0       Prof          B   56       49    Male  186960
9       Prof          A   51       51    Male   57800

[78 rows x 6 columns]

In [10]:
df[df["sex"] == "Female"]

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [71]:
df.groupby(["rank"]).sum()

            phd  service   salary
rank
AssocProf   196      147  1193221
AsstProf     96       42  1545893
Prof       1245      985  5686741

In [11]:
df["column_4"] = 0 # create a column with value

In [38]:
df.drop_duplicates() # duplicates lam remove aakidum

,rank,discipline,phd,service,sex,salary,column_4,column_5,column_6
0,Prof,B,56.0,49.0,Male,186960.0,0.0,4.0,105.0
1,Prof,A,12.0,6.0,Male,93000.0,0.0,4.0,18.0
2,Prof,A,23.0,20.0,Male,110515.0,0.0,4.0,43.0
3,Prof,A,40.0,31.0,Male,131205.0,0.0,4.0,71.0
4,Prof,B,20.0,18.0,Male,104800.0,0.0,4.0,38.0
...,...,...,...,...,...,...,...,...,...
74,AssocProf,B,19.0,6.0,Female,104542.0,0.0,4.0,25.0
75,Prof,B,17.0,17.0,Female,124312.0,0.0,4.0,34.0
76,Prof,A,28.0,14.0,Female,109954.0,0.0,4.0,42.0
77,Prof,A,23.0,15.0,Female,109646.0,0.0,4.0,38.0
column_6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
df["column_5"] = 4

In [22]:
df["column_6"] = df.phd+df.service # create new column assign column name + next column name

In [46]:
df.describe(include= "all") # unique and top freq lam add aakum

,rank,discipline,phd,service,sex,salary,column_4,column_5,column_6
count,78,78,78.000000,78.000000,78,78.000000,78.0,78.0,78.000000
unique,3,2,NaN,NaN,2,NaN,NaN,NaN,NaN
top,Prof,B,NaN,NaN,Male,NaN,NaN,NaN,NaN
freq,46,42,NaN,NaN,39,NaN,NaN,NaN,NaN
mean,NaN,NaN,19.705128,15.051282,NaN,108023.782051,0.0,4.0,34.756410
std,NaN,NaN,12.498425,12.139768,NaN,28293.661022,0.0,0.0,24.185531
min,NaN,NaN,1.000000,0.000000,NaN,57800.000000,0.0,4.0,1.000000
25%,NaN,NaN,10.250000,5.250000,NaN,88612.500000,0.0,4.0,15.250000
50%,NaN,NaN,18.500000,14.500000,NaN,104671.000000,0.0,4.0,34.500000
75%,NaN,NaN,27.750000,20.750000,NaN,126774.750000,0.0,4.0,47.750000
max,NaN,NaN,56.000000,51.000000,NaN,186960.000000,0.0,4.0,105.000000

In [47]:
df.describe()

             phd    service         salary  column_4  column_5    column_6
count  78.000000  78.000000      78.000000      78.0      78.0   78.000000
mean   19.705128  15.051282  108023.782051       0.0       4.0   34.756410
std    12.498425  12.139768   28293.661022       0.0       0.0   24.185531
min     1.000000   0.000000   57800.000000       0.0       4.0    1.000000
25%    10.250000   5.250000   88612.500000       0.0       4.0   15.250000
50%    18.500000  14.500000  104671.000000       0.0       4.0   34.500000
75%    27.750000  20.750000  126774.750000       0.0       4.0   47.750000
max    56.000000  51.000000  186960.000000       0.0       4.0  105.000000

In [25]:
len(df) # how many rows are there

79

In [51]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
phd,78.0,19.705128,12.498425,1.0,10.25,18.5,27.75,56.0
service,78.0,15.051282,12.139768,0.0,5.25,14.5,20.75,51.0
salary,78.0,108023.782051,28293.661022,57800.0,88612.50,104671.0,126774.75,186960.0
column_4,78.0,0.000000,0.000000,0.0,0.00,0.0,0.00,0.0
column_5,78.0,4.000000,0.000000,4.0,4.00,4.0,4.00,4.0
column_6,78.0,34.756410,24.185531,1.0,15.25,34.5,47.75,105.0

In [50]:
df.isna().sum() # how many null values are there

rank          1
discipline    1
phd           1
service       1
sex           1
salary        1
column_4      1
column_5      1
column_6      1
dtype: int64

In [36]:
df[df["service"] > 30]

,rank,discipline,phd,service,sex,salary,column_4,column_5,column_6
0,Prof,B,56.0,49.0,Male,186960.0,0.0,4.0,105.0
3,Prof,A,40.0,31.0,Male,131205.0,0.0,4.0,71.0
9,Prof,A,51.0,51.0,Male,57800.0,0.0,4.0,102.0
10,Prof,B,39.0,33.0,Male,128250.0,0.0,4.0,72.0
13,Prof,B,35.0,33.0,Male,162200.0,0.0,4.0,68.0
25,Prof,B,35.0,31.0,Male,99418.0,0.0,4.0,66.0
27,Prof,A,45.0,43.0,Male,155865.0,0.0,4.0,88.0
36,Prof,B,45.0,45.0,Male,146856.0,0.0,4.0,90.0
40,Prof,A,39.0,36.0,Female,137000.0,0.0,4.0,75.0

In [43]:
df.fillna("karthik") # it will fill empty row

,rank,discipline,phd,service,sex,salary,column_4,column_5,column_6
0,Prof,B,56.0,49.0,Male,186960.0,0.0,4.0,105.0
1,Prof,A,12.0,6.0,Male,93000.0,0.0,4.0,18.0
2,Prof,A,23.0,20.0,Male,110515.0,0.0,4.0,43.0
3,Prof,A,40.0,31.0,Male,131205.0,0.0,4.0,71.0
4,Prof,B,20.0,18.0,Male,104800.0,0.0,4.0,38.0
...,...,...,...,...,...,...,...,...,...
74,AssocProf,B,19.0,6.0,Female,104542.0,0.0,4.0,25.0
75,Prof,B,17.0,17.0,Female,124312.0,0.0,4.0,34.0
76,Prof,A,28.0,14.0,Female,109954.0,0.0,4.0,42.0
77,Prof,A,23.0,15.0,Female,109646.0,0.0,4.0,38.0
column_6,karthik,karthik,karthik,karthik,karthik,karthik,karthik,karthik,karthik

In [44]:
df.drop(columns=["column_6"])

,rank,discipline,phd,service,sex,salary,column_4,column_5
0,Prof,B,56.0,49.0,Male,186960.0,0.0,4.0
1,Prof,A,12.0,6.0,Male,93000.0,0.0,4.0
2,Prof,A,23.0,20.0,Male,110515.0,0.0,4.0
3,Prof,A,40.0,31.0,Male,131205.0,0.0,4.0
4,Prof,B,20.0,18.0,Male,104800.0,0.0,4.0
...,...,...,...,...,...,...,...,...
74,AssocProf,B,19.0,6.0,Female,104542.0,0.0,4.0
75,Prof,B,17.0,17.0,Female,124312.0,0.0,4.0
76,Prof,A,28.0,14.0,Female,109954.0,0.0,4.0
77,Prof,A,23.0,15.0,Female,109646.0,0.0,4.0
column_6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [56]:
df.describe(exclude='O') #df.describe(exclude='O')

             phd    service         salary  column_4  column_5    column_6
count  78.000000  78.000000      78.000000      78.0      78.0   78.000000
mean   19.705128  15.051282  108023.782051       0.0       4.0   34.756410
std    12.498425  12.139768   28293.661022       0.0       0.0   24.185531
min     1.000000   0.000000   57800.000000       0.0       4.0    1.000000
25%    10.250000   5.250000   88612.500000       0.0       4.0   15.250000
50%    18.500000  14.500000  104671.000000       0.0       4.0   34.500000
75%    27.750000  20.750000  126774.750000       0.0       4.0   47.750000
max    56.000000  51.000000  186960.000000       0.0       4.0  105.000000

In [57]:
df.describe(exclude='O') #CAPITAL O KODUTHTHA VARUM

             phd    service         salary  column_4  column_5    column_6
count  78.000000  78.000000      78.000000      78.0      78.0   78.000000
mean   19.705128  15.051282  108023.782051       0.0       4.0   34.756410
std    12.498425  12.139768   28293.661022       0.0       0.0   24.185531
min     1.000000   0.000000   57800.000000       0.0       4.0    1.000000
25%    10.250000   5.250000   88612.500000       0.0       4.0   15.250000
50%    18.500000  14.500000  104671.000000       0.0       4.0   34.500000
75%    27.750000  20.750000  126774.750000       0.0       4.0   47.750000
max    56.000000  51.000000  186960.000000       0.0       4.0  105.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [5]:
df.isnull().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [6]:
df.dropna(how="any").shape # we find any null value remove full row

(78, 6)

In [7]:
df.dropna(how="any") # it will show result of removed null value

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [8]:
df.shape

(78, 6)

In [9]:
df.dropna(how="all").shape # row fulla null value iruntha athu fulla remove aakum

(78, 6)

In [ ]:
#subset column la irukura particular null value mattum remove aakum

In [11]:
df.dropna(subset=["rank"],how="any").shape

(78, 6)

In [12]:
df.dropna(subset=["rank","sex"],how="any").shape

(78, 6)

In [3]:
df.dropna(subset=["rank","sex"],how="all").shape

NameError: name 'df' is not defined

In [18]:
list1 = ["L","w","m"]

In [19]:
pd.Series(list1,lst2) # Series na particular row list1 and lst to it will show the data

a    L
b    w
c    m
dtype: object

In [23]:
import pandas as pd
import numpy as np

In [25]:
lst2 = ["a","b","c"]

In [28]:
pd.Series(data = lst2,index=list1) # it will change data to index index to data pd.series(data= lst2,index=lst1)

L    a
w    b
m    c
dtype: object

In [30]:
d = {"a":"L","b":"w","m":"c"}

d

{'a': 'L', 'b': 'w', 'm': 'c'}

In [31]:
pd.Series(d)

a    L
b    w
m    c
dtype: object

In [37]:
s1 = pd.Series(crc,index = [1,2,3,4])

In [35]:
crc = ['dhoni','kohli','Andreson','sachin']

In [38]:
s1

1       dhoni
2       kohli
3    Andreson
4      sachin
dtype: object

In [40]:
s2 = pd.Series(avg) # normal la index varum defalt index

In [39]:
avg = ["ironman","captain","thor","groot"]

In [41]:
s2

0    ironman
1    captain
2       thor
3      groot
dtype: object

In [42]:
ser1 = pd.Series([1,2,3,4],index = ["usa","germani","italy","japan"])

In [43]:
ser1

usa        1
germani    2
italy      3
japan      4
dtype: int64

In [44]:
ser2 = pd.Series([1,2,3,4],index = ["usa","germani","ussr","japan"])

In [45]:
ser2

usa        1
germani    2
ussr       3
japan      4
dtype: int64

In [46]:
ser1+ser2,

germani    4.0
italy      NaN
japan      8.0
usa        2.0
ussr       NaN
dtype: float64

In [49]:
ser1["italy"]

3

In [50]:
from numpy.random import randn

In [55]:
                        #row,column
df = pd.DataFrame(randn(5,5),index="A B C D E".split(),columns="p q r s t".split()) # randn na random ma number varum 5 row la
# and columns la

In [56]:
df

          p         q         r         s         t
A -1.183836 -0.985016 -0.649533  0.225891  0.104376
B -0.895240 -0.206610 -0.052079 -0.178907  1.566885
C -0.380127  1.859271  0.038477  0.569538  0.935598
D -0.542174  0.686017 -1.282817  0.035038  0.563899
E -0.602320 -1.749866 -0.549130 -1.828959 -2.026434

In [ ]:
# oru row oru column iruntha athu Series more than one na iruntha athu DataFrame

In [57]:
type(df["p"])

pandas.core.series.Series

In [60]:
type(df[["p","s"]]) # 2 BRACKIT CLOSE PANNANUM

pandas.core.frame.DataFrame

In [62]:
df.r

A   -0.649533
B   -0.052079
C    0.038477
D   -1.282817
E   -0.549130
Name: r, dtype: float64

In [63]:
df["u"] = df["p"] - df["q"] # create ya column

In [75]:
df.drop("u",axis=1,inplace = True)  # delete column

In [73]:
df.drop("E",axis=0) # row ku axis la 0 row la ethana change panna axis =0 column la ethana changes panna axis=1

          p         q         r         s         t         u
A -1.183836 -0.985016 -0.649533  0.225891  0.104376 -0.198820
B -0.895240 -0.206610 -0.052079 -0.178907  1.566885 -0.688630
C -0.380127  1.859271  0.038477  0.569538  0.935598 -2.239398
D -0.542174  0.686017 -1.282817  0.035038  0.563899 -1.228190

In [76]:
df # drop fulla aakathu namba accident ta drop panniduvom athanala athuku inplace = true kodukanum

          p         q         r         s         t
A -1.183836 -0.985016 -0.649533  0.225891  0.104376
B -0.895240 -0.206610 -0.052079 -0.178907  1.566885
C -0.380127  1.859271  0.038477  0.569538  0.935598
D -0.542174  0.686017 -1.282817  0.035038  0.563899
E -0.602320 -1.749866 -0.549130 -1.828959 -2.026434

In [84]:
#oru df kodutha boolean irukum true false tha varum
df[df["p"] > 0] [["p","s"]] #

Empty DataFrame
Columns: [p, s]
Index: []

In [86]:
df[df["p"] > 0] ["p"] #column p la irukura value mattum varum >0 va iruntha

Series([], Name: p, dtype: float64)

In [87]:
df[df["p"]>0] # ipdi kodutha full column varum

Empty DataFrame
Columns: [p, q, r, s, t]
Index: []

In [88]:
df["p"] > 0

A    False
B    False
C    False
D    False
E    False
Name: p, dtype: bool

In [91]:
df[df["p"] <0]["s"] # s list tu show pannum value lam

A    0.225891
B   -0.178907
C    0.569538
D    0.035038
E   -1.828959
Name: s, dtype: float64

In [92]:
df

          p         q         r         s         t
A -1.183836 -0.985016 -0.649533  0.225891  0.104376
B -0.895240 -0.206610 -0.052079 -0.178907  1.566885
C -0.380127  1.859271  0.038477  0.569538  0.935598
D -0.542174  0.686017 -1.282817  0.035038  0.563899
E -0.602320 -1.749866 -0.549130 -1.828959 -2.026434

In [93]:
df[(df["p"] < 0) & (df["s"] > 0)] # two condition statisfaction aana

          p         q         r         s         t
A -1.183836 -0.985016 -0.649533  0.225891  0.104376
C -0.380127  1.859271  0.038477  0.569538  0.935598
D -0.542174  0.686017 -1.282817  0.035038  0.563899

In [105]:
df.reset_index() # index default ta vanthuchi

  level_0         p         q         r         s         t index
0       A -1.183836 -0.985016 -0.649533  0.225891  0.104376    AA
1       B -0.895240 -0.206610 -0.052079 -0.178907  1.566885    BB
2       C -0.380127  1.859271  0.038477  0.569538  0.935598    CC
3       D -0.542174  0.686017 -1.282817  0.035038  0.563899    DD
4       E -0.602320 -1.749866 -0.549130 -1.828959 -2.026434    EE

In [3]:
dl = "AA BB CC DD EE".split()

['AA', 'BB', 'CC', 'DD', 'EE']

In [101]:
df["index"] = dl # ceate a column

In [1]:
po = "f a g h k".split()

In [2]:
po

['f', 'a', 'g', 'h', 'k']

In [44]:
df["karthi"] = po

ValueError: Length of values (5) does not match length of index (3)

In [106]:
df.set_index("index") # column ma index la konduvara set_index use aakuthu

              p         q         r         s         t
index
AA    -1.183836 -0.985016 -0.649533  0.225891  0.104376
BB    -0.895240 -0.206610 -0.052079 -0.178907  1.566885
CC    -0.380127  1.859271  0.038477  0.569538  0.935598
DD    -0.542174  0.686017 -1.282817  0.035038  0.563899
EE    -0.602320 -1.749866 -0.549130 -1.828959 -2.026434

In [112]:
outside = ["g1","g1","g1","g2","g2","g2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #zip pannatha data type ku convert pannatha front la list tharom
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [113]:
hier_index

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 1),
            ('g2', 2),
            ('g2', 3)],
           )

In [116]:
#                                6 row 2 column
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=["A","B"])
df

             A         B
g1 1 -0.196123  0.254457
   2 -0.353723 -2.322873
   3 -0.654324 -0.434855
g2 1  1.484068 -2.755186
   2  0.344252  0.838987
   3 -0.450795 -0.256707

In [117]:
df.loc["g1"] #loc for name iloc for index number

          A         B
1 -0.196123  0.254457
2 -0.353723 -2.322873
3 -0.654324 -0.434855

In [ ]:
df.index.names # index ku name kodukurom

In [118]:
df.index.names = ["group","num"]

In [119]:
df

                  A         B
group num
g1    1   -0.196123  0.254457
      2   -0.353723 -2.322873
      3   -0.654324 -0.434855
g2    1    1.484068 -2.755186
      2    0.344252  0.838987
      3   -0.450795 -0.256707

In [120]:
df.loc["g1"].loc[1] # g1 la A 1 row vum B 1 row vum varum

A   -0.196123
B    0.254457
Name: 1, dtype: float64

In [122]:
df.xs(["g1",1]) # same mela irukuramathiri varum

C:\Users\gunak\AppData\Local\Temp\ipykernel_3952\3012490004.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(["g1",1])

A   -0.196123
B    0.254457
Name: (g1, 1), dtype: float64

In [123]:
df.xs(1,level="num") # number g1 g2 la irukura 1 la irukura value lam varum

              A         B
group
g1    -0.196123  0.254457
g2     1.484068 -2.755186

In [124]:
df

                  A         B
group num
g1    1   -0.196123  0.254457
      2   -0.353723 -2.322873
      3   -0.654324 -0.434855
g2    1    1.484068 -2.755186
      2    0.344252  0.838987
      3   -0.450795 -0.256707

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"A":[1,2,np.nan],
                   "b":[1,np.nan,np.nan],
                    "c":[1,2,3]})

In [ ]:
df

In [13]:
df.dropna(axis=1) # nan not a number illama varum

   c
0  1
1  2
2  3

In [12]:
df

     A    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.dropna(thresh = 2) # thresh 2 kodutha orey oru null value kaatum

     A    b  c
0  1.0  1.0  1
1  2.0  NaN  2

In [16]:
df.dropna(thresh = 1)

     A    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [17]:
df["b"].fillna(value = df["c"].mean()) # b la null nu irukura value laam  c total value/count of c mean vanthudum

0    1.0
1    2.0
2    2.0
Name: b, dtype: float64

In [19]:
df.fillna(value= "***") # nan value lam star fill aakum

     A    b  c
0  1.0  1.0  1
1  2.0  ***  2
2  ***  ***  3

In [25]:
fg = pd.DataFrame(np.random.randn(5,2), index = "A B C D E".split(), columns = ["A","B"])
fg

          A         B
A  1.137535  0.154236
B -0.559027 -0.365295
C -1.631154  0.470573
D  1.022671 -0.738903
E  1.102241 -0.044310

In [61]:
fg.loc["B"]

A   -0.559027
B   -0.365295
Name: B, dtype: float64

In [47]:
data = {"company":["good","goog","msft","msft","fb","fb"],
        "person":["charly","sam","amy","vanesh","carl","sarah"],
        "sales":[200,120,300,124,243,350]}
fc = pd.DataFrame(data)

In [48]:
fc

  company  person  sales
0    good  charly    200
1    goog     sam    120
2    msft     amy    300
3    msft  vanesh    124
4      fb    carl    243
5      fb   sarah    350

In [59]:
fc.groupby("company").describe() # describe is a function

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
good      1.0  200.0         NaN  200.0  200.00  200.0  200.00  200.0
goog      1.0  120.0         NaN  120.0  120.00  120.0  120.00  120.0
msft      2.0  212.0  124.450793  124.0  168.00  212.0  256.00  300.0

In [54]:
d2.mean()

sales    334.25
dtype: float64

In [62]:
fg.iloc[1]

A   -0.559027
B   -0.365295
Name: B, dtype: float64

In [63]:
fg.loc["A","B"]

0.15423624797408772